package solution

/*
问题：
有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子， 假如兔子都不死，问每个月的兔子总数为多少

思路：
月份														总数
一月 1												.... 1
二月 1												.... 1
三月 1 1												.... 2
四月 1 1 1											.... 3
五月 1 1 1 1 1										.... 5
六月 1 1 1 1 1 1 1 1									.... 8
七月 1 1 1 1 1 1 1 1 1 1 1 1 1						.... 13
八月 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1		.... 21

观察得知，为斐波那契数列
*/
func rabbit(n int) int {
	if n == 1 || n == 2 {
		return 1
	}
	return rabbit(n-1) + rabbit(n-2)
}

func rabbit1(n int) int {
	x, y := 0, 1
	for i := 0; i < n; i++ {
		x, y = y, x+y
	}
	return x
}
